# Read and write CSV and XLS files

In [1]:
import pandas as pd
df = pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [2]:
!pip3 install xlrd

Requirement already satisfied: xlrd in c:\users\mnr41\appdata\local\programs\python\python38\lib\site-packages (1.2.0)

In [3]:
#INSTALL: pip3 install xlrd

#read excel file 
df_excel = pd.read_excel('weather_data.xlsx')
df_excel

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [7]:
#write DF to csv
df_excel.to_csv('new.csv') 
df_excel.to_csv('new_noIndex.csv', index=False)

In [8]:
# to convert df to excel use openpyxl package ,  INSTALL: pip3 install openpyxl

In [9]:
!pip3 install openpyxl

Requirement already satisfied: openpyxl in c:\users\mnr41\appdata\local\programs\python\python38\lib\site-packages (3.0.2)
Requirement already satisfied: jdcal in c:\users\mnr41\appdata\local\programs\python\python38\lib\site-packages (from openpyxl) (1.4.1)
Requirement already satisfied: et_xmlfile in c:\users\mnr41\appdata\local\programs\python\python38\lib\site-packages (from openpyxl) (1.0.1)

In [14]:
#write DF to Excel
df.to_excel('new_weather.xlsx', sheet_name='weather_info')

In [16]:
#write DF to Excel, single excel files contain multiple sheets
df.to_excel('new_weather.xlsx', sheet_name='b_data')

# GROUP-BY

In [17]:
import pandas as pd
df = pd.read_csv('weather_data_cities.csv')
df #weather by cities

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [21]:
# make a group based on a value of city columns
g = df.groupby('city')
g

In [27]:
print(tuple(g))

(('mumbai',         day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain), ('new york',         day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny), ('paris',          day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy))

####  So first value in tuple is group value name and second is grouped dataframe

In [28]:
for city, city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [29]:
#or to get specific group
g.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [30]:
#Find maximum temperature in each of the cities
print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [31]:
print(g.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [32]:
print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

In [34]:
g.describe(include='all')

           day                                                      ...  \
         count unique       top freq mean  std  min  25%  50%  75%  ...
city                                                                ...
mumbai       4      4  1/3/2017    1  NaN  NaN  NaN  NaN  NaN  NaN  ...
new york     4      4  1/3/2017    1  NaN  NaN  NaN  NaN  NaN  NaN  ...
paris        4      4  1/3/2017    1  NaN  NaN  NaN  NaN  NaN  NaN  ...

          event
         unique     top freq mean  std  min  25%  50%  75%  max
city
mumbai        3     Fog    2  NaN  NaN  NaN  NaN  NaN  NaN  NaN
new york      3   Sunny    2  NaN  NaN  NaN  NaN  NaN  NaN  NaN
paris         2  Cloudy    3  NaN  NaN  NaN  NaN  NaN  NaN  NaN

[3 rows x 44 columns]

In [35]:
grouped_describe = g.describe()
grouped_describe

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# concatenate Data Frames

In [36]:
import pandas as pd
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})

india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [37]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

#### Concating data frame row-wise:

In [40]:
#concate two dataframes
df = pd.concat([india_weather, us_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [41]:
#if you want continuous index
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

#### Concating data frame row-wise:

In [43]:
df = pd.concat([india_weather, us_weather],axis=1)
df

       city  temperature  humidity      city  temperature  humidity
0    mumbai           32        80  new york           21        68
1     delhi           45        60   chicago           14        65
2  banglore           30        78   orlando           35        75

In [46]:
df = pd.concat([india_weather, us_weather],axis= -1)
df

ValueError: No axis named -1 for object type <class 'pandas.core.frame.DataFrame'>

# Merge DataFrames

In [47]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore", 'hyderabad'],
    "temperature": [32,45,30,40]})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2   banglore           30
3  hyderabad           40

In [48]:
humidity_df = pd.DataFrame({
    "city": ["delhi","mumbai","banglore"],
    "humidity": [68, 65, 75]})
humidity_df

       city  humidity
0     delhi        68
1    mumbai        65
2  banglore        75

In [49]:
#merge two dataframes with out explicitly mention index
df = pd.merge(temperature_df, humidity_df, on='city')
df

       city  temperature  humidity
0    mumbai           32        65
1     delhi           45        68
2  banglore           30        75

In [50]:
#OUTER-JOIN
df = pd.merge(temperature_df, humidity_df, on='city', how='outer')
df

        city  temperature  humidity
0     mumbai           32      65.0
1      delhi           45      68.0
2   banglore           30      75.0
3  hyderabad           40       NaN

# Numerical Indexing (.loc vs iloc)

In [51]:
import pandas as pd
import numpy as np

In [52]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,19], index=[49,48,47,46,45, 1, 2, 3, 4, 5])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   19

In [54]:
df.loc[3]

0    8
Name: 3, dtype: int64

In [55]:
df.loc[45]

0    5
Name: 45, dtype: int64

In [56]:
df.iloc[3]

0    4
Name: 46, dtype: int64

In [57]:
df.iloc[45]

IndexError: single positional indexer is out-of-bounds

In [59]:
#data till index name = 2
df.loc[:2]

    0
49  1
48  2
47  3
46  4
45  5
1   6
2   7

In [61]:
# data till row number 2 , row start from 0
df.iloc[:2]

    0
49  1
48  2

In [63]:
df.loc[45]

0    5
Name: 45, dtype: int64

In [64]:
df.iloc[45]

IndexError: single positional indexer is out-of-bounds